alert("Загадкова Історія Скайвокера в епоху Лицарства")

alert ("Сір Роберт ставить перед Люком випробування, що визначить його долю.")
 let початокШляху = prompt("1-Вирушити в ліc 2-Піти через село, 3-Відправитися до замку дракона ")

 if (початокШляху == 1) { alert ("Люк зустрічає чарівницю, що пропонує зілля сили в обмін на обіцянку.")} else{}
 

 if (початокШляху == 2) {alert ("Люк допомагає селянам, які потерпають від голови розбійників.")} else{}


 if (початокШляху == 3) {alert ("Люк вирішує випробувати себе, викликаючи дракона на бій.")} else{}

console. log(початокШляху)

if (початокШляху == 1) {
let ліс = prompt ("1-Прийняти зілля. 2- Відмовитися")

 if (ліс == 1){ alert  ("Люк отримує надприродну силу, але залишається в боргу перед чарівницею.")} 
 else if (ліс == 2) {alert("Люк вибирає чесний шлях, відмовляючись від легкого успіху.")}
 else {}

 if (ліс == 2) {
    
    alert("Після повернення з подорожей Люка викликають на турнір.")
 let турнір = prompt("1-Боротьба за честь. 2- Допомога іншому учаснику. 3- Відмова від бою")
 if (турнір == 1) {alert ("Люк демонструє свої навички, здобуваючи повагу."); alert ("Люк стає рицарем, відомим своєю чесністю та мужністю, обираючи шлях служіння королівству.")} 
 else if (турнір == 2) {alert ("Люк допомагає пораненому рицарю, показуючи своє серце.")}
 else if (турнір == 3) {alert ("Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати.")} 
 else{}

 }



console.log(ліс)

}

if (початокШляху == 2) {

let село  = prompt ("1- Допомогти силою. 2- Знайти мирне рішенн")
 if (село == 1) { alert ("Люк використовує силу для захисту селян, але отримує поранення.")}
 else if (село == 2) {alert ("Люк вирішує конфлікти миром, заробляючи повагу як лідера.")} 

if(село == 2) {}
 alert("Після повернення з подорожей Люка викликають на турнір.")
 let турнір = prompt("1-Боротьба за честь. 2- Допомога іншому учаснику. 3- Відмова від бою")
 if (турнір == 1) {alert ("Люк демонструє свої навички, здобуваючи повагу.")} 
 else if (турнір == 2) {alert ("Люк допомагає пораненому рицарю, показуючи своє серце.")}
 else if (турнір == 3) {alert ("Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати."); alert("Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті.")} 
 else{}
 

 console.log(турнір)

console.log(село)
}

if (початокШляху == 3) {
let дракон = prompt ("1-Бій з драконом 2-Спроба перемовин")
  if (дракон == 1) {alert ("Люк гине, але його вчинок вважається героїчним.");alert  ("Люк гине, але його ім'я вічно живе в легендах як символ непереможної сміливості та жертовності.") }
  else if (дракон == 2) {alert ("Люк дізнається, що дракон не хоче воювати, і вони досягають миру.")}

if (дракон == 2) {
    alert ("Король, вражений діями Люка, пропонує йому останнє завдання.")
let випробуванняКороля = prompt("1-Захистити королівство. 2-Пошук зниклої реліквії.")
if (випробуванняКороля == 1) {alert("Люк веде війська проти ворога, демонструючи свою відвагу.")} 
else if (випробуванняКороля == 2) {alert("Люк вирушає за древньою реліквією, що може врятувати королівство.");alert("Люк доводить, що можна знайти мир навіть із драконами, і врятувати королівство без насильства, стаючи легендою.") } 
else{}


console.log(випробуванняКороля)
}




 console.log(дракон)
}




// alert ("Король, вражений діями Люка, пропонує йому останнє завдання.")
// let випробуванняКороля = prompt("1-Захистити королівство. 2-Пошук зниклої реліквії.")
// if (випробуванняКороля == 1) {alert("Люк веде війська проти ворога, демонструючи свою відвагу.")} 
// else if (випробуванняКороля == 2) {alert("Люк вирушає за древньою реліквією, що може врятувати королівство.")} else{}

// console.log(дракон)
// console.log(випробуванняКороля)
// }
